cases/ansys_verification/VMFL045/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Manual p. 153: "The flow is steady and laminar."
simulationType  laminar;
